ALTER TABLE crmp_tenant MODIFY created_by varchar(32) DEFAULT NULL; 
INSERT INTO `CRMP_Tenant` VALUES 
('1',65535,65535,'Madz Technologies','9999-06-11 19:01:53','Barry',0,0,0,0,NULL,'2011-06-11 19:01:53',0,0,0,'2011-06-11 19:01:53','',NULL,NULL,NULL);
INSERT INTO `CRMP_User` VALUES 
('1',NULL,0,0,0,NULL,'4a6dfef787c0e3d8a5ccacb67e709060',NULL,'Barry Zhong',NULL,NULL,NULL,NULL,NULL,'zhongdj@gmail.com',NULL,NULL,0,'zhongdj@gmail.com','1','1',NULL),
('2',0,0,0,0,'2011-08-08 21:54:32','4a6dfef787c0e3d8a5ccacb67e709060','2011-08-08 21:37:07','Barry Zhong','2011-06-22 01:33:27',4,'2011-06-22 01:33:27',NULL,'','administrator',0,NULL,0,'zhongdj@gmail.com','1','1',NULL);
UPDATE `crmp_tenant` SET CREATED_BY = '1';
ALTER TABLE crmp_tenant modify created_by varchar(32) NOT NULL;

INSERT INTO `CRMP_USER_GROUP` VALUES 
('1','ADMINGroup',NULL,0,'2011-06-22 01:32:49','1','1',NULL),
('2','OPGroup',NULL,0,'2011-06-22 01:32:49','1','1',NULL);

INSERT INTO `CRMP_Role` VALUES 
('1',NULL,'2011-06-22 01:32:49',0,'SA','1','1',NULL),
('2',NULL,'2011-06-22 01:32:49',0,'ADMIN','1','1',NULL),
('3',NULL,'2011-06-22 01:32:49',0,'OP','1','1',NULL);

INSERT INTO `CRMP_USER_USER_GROUP` (GROUP_NAME,USERNAME) VALUES 
('ADMINGroup','administrator'),
('ADMINGroup','zhongdj@gmail.com');

INSERT INTO `CRMP_User_CRMP_Role` VALUES 
('1','1'),
('1','2');

ALTER TABLE crmp_user_group_crmp_role ADD COLUMN GROUP_NAME varchar(40) NOT NULL;

INSERT INTO `crmp_user_group_crmp_role` VALUES 
('1','1','ADMINGroup');


INSERT INTO `CRMP_Menu_Item` VALUES 

('1','net.vicp.madz.framework.views.SystemSettings','2011-06-22 01:35:26','外观偏好',NULL,'application',0,'1',NULL,'1',NULL),
('2','','2011-06-22 01:35:26','基础数据',NULL,'',0,'1',NULL,'1',NULL),
('3','net.vicp.madz.biz.common.views.CategoryView','2011-06-22 01:35:26','产品分类',NULL,'dataGrid',0,'1','2','1',NULL),
('4','net.vicp.madz.biz.common.views.MerchandiseView','2011-06-22 01:35:26','产品',NULL,'dataGrid',0,'1','2','1',NULL),
('5','net.vicp.madz.biz.common.views.UnitOfMeasureView','2011-06-22 01:35:26','计量单位',NULL,'dataGrid',0,'1','2','1',NULL),

('6','','2011-08-02 13:19:20','系统管理',NULL,'',0,'1',NULL,'1',NULL),
('7','net.vicp.madz.admin.views.MenuItemView','2011-08-02 13:19:20','功能',NULL,'dataGrid',0,'1','6','1',NULL),
('8','net.vicp.madz.admin.views.RoleView','2011-08-08 18:50:00','角色',NULL,'dataGrid',0,'1','6','2',NULL),

('10','','2011-08-08 22:13:26','原始生产数据导入服务',NULL,'',0,'1',NULL,'2',NULL),
('11','net.vicp.madz.etl.views.RelationshipMappingView','2011-08-08 22:31:30','关系字段映射',NULL,'dataGrid',0,'1','10','2',NULL),
('12','net.vicp.madz.etl.views.KeySettingView','2011-08-08 22:24:49','原始数据表键设定',NULL,'dataGrid',0,'1','10','2',NULL),
('13','net.vicp.madz.etl.views.SchemaSettingView','2011-08-08 22:29:31','生产数据模式映射',NULL,'dataGrid',0,'1','10','2',NULL),

('14','','2011-08-08 22:29:30','账户管理',NULL,'',0,'1',NULL,'2',NULL),
('15','net.vicp.madz.account.views.AccountView','2011-08-20 00:00:00','账户',NULL,'dataGrid',0,'1','14','2',NULL),
('16','net.vicp.madz.account.views.ContactView','2011-08-20 00:00:00','联系人',NULL,'dataGrid',0,'1','14','2',NULL),

('17','','2011-08-08 22:29:30','合同管理',NULL,'',0,'1',NULL,'2',NULL),
('18','net.vicp.madz.contract.views.UnitOfProjectView','2011-08-20 00:00:00','单位工程',NULL,'dataGrid',0,'1','17','2',NULL),
('19','net.vicp.madz.contract.views.ContractView','2011-08-20 00:00:00','合同',NULL,'dataGrid',0,'1','17','2',NULL),
('20','net.vicp.madz.contract.views.ProjectView','2011-08-20 00:00:00','工程',NULL,'dataGrid',0,'1','17','2',NULL),


('21','','2011-08-08 22:29:30','生产管理',NULL,'',0,'1',NULL,'2',NULL),
('22','net.vicp.madz.production.views.ProductionRecordView','2011-08-20 00:00:00','生产记录',NULL,'dataGrid',0,'1','21','2',NULL),
('23','net.vicp.madz.production.views.PlantView','2011-08-20 00:00:00','生产线',NULL,'dataGrid',0,'1','21','2',NULL),

('24','','2011-08-20 00:00:00','往来帐管理',NULL,'',0,'1',NULL,'2',NULL),
('25','net.vicp.madz.invoice.views.InvoiceView','2011-08-20 00:00:00','往来帐',NULL,'dataGrid',0,'1','24','2',NULL),
('26','net.vicp.madz.invoice.views.AccountRunView','2011-08-20 00:00:00','记账任务',NULL,'dataGrid',0,'1','24','2',NULL);

INSERT INTO `CRMP_ROLE_MENU_ITEM` VALUES 
('1','1'),
('2','1'),
('3','1'),
('4','1'),
('5','1'),
('6','1'),
('7','1'),
('8','1'),
('2','2'),
('3','2'),
('4','2'),
('5','2'),
('10','1'),
('11','1'),
('12','1'),
('13','1'),
('14','1'),
('15','1'),
('16','1'),
('17','1'),
('18','1'),
('19','1'),
('20','1'),
('21','1'),
('22','1'),
('23','1'),
('24','1'),
('25','1'),
('26','1');

INSERT INTO `crmp_unit_of_measure` VALUES 
('87abb1f6-aa72-4f62-a220-00f2e4306cbf','方','2011-06-22 01:39:35','立方米','2011-08-08 22:10:29',0,'1','2','2');

INSERT INTO `crmp_product` VALUES 

('13af8108-7492-4d18-80fd-ef944d7bfc40',20,'2011-10-17 11:19:09','外加剂','2011-10-17 11:32:08',1,'抗渗S6',0,'----6--','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('1bf6aa81-0248-4786-a372-2ab7120cc162',565,'2011-10-17 11:13:55','混凝土强度等级','2011-10-17 11:32:08',0,'C55',0,'C55----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('1ed1bfd7-0a3b-4eaa-9a96-c27b28a011d8',40,'2011-10-17 11:19:52','外加剂','2011-10-17 11:32:08',1,'抗渗S10',0,'----0--','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('2cd77e7e-d8e2-4dac-b027-9455b2cdcda8',60,'2011-10-17 11:24:44','外加剂','2011-10-17 11:32:08',1,'防冻-15度',0,'-----3-','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('2d33b65f-ba57-4797-8689-993c35114cd5',365,'2011-10-17 11:12:27','混凝土强度等级','2011-10-17 11:32:08',0,'C30',0,'C30----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('53e56be7-2963-476c-b8b1-6d58da3f2ca6',30,'2011-10-17 11:27:41','冬季施工费','2011-10-17 11:32:08',1,'冬季施工-10度以内',0,'------1','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('54c0a166-aa5c-4592-a753-82146e91b24d',340,'2011-10-17 11:16:07','砂浆强度等级','2011-10-17 11:32:08',0,'M15',0,'M15----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('5de357f3-5601-4bd2-86b8-097b1ac5f1c6',20,'2011-06-22 01:44:46','外加剂','2011-10-17 11:32:08',1,'缓凝',0,'---H---','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','1','2'),
('6448ee25-9b96-4c3d-b52b-a5676c761a8d',50,'2011-10-17 11:20:23','外加剂','2011-10-17 11:32:08',1,'抗渗S12',0,'----2--','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('6757e9c6-0f63-4c01-9355-98319e3d71cd',40,'2011-10-17 11:26:08','外加剂','2011-10-17 11:32:08',1,'路面',0,'------L','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('6a72fd5e-03b2-4284-b9cd-669458f84025',395,'2011-10-17 11:12:44','混凝土强度等级','2011-10-17 11:32:08',0,'C35',0,'C35----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('7008cf24-af31-4b10-bc87-a2129dea62fe',40,'2011-10-17 11:24:21','外加剂','2011-10-17 11:32:08',1,'防冻-10度',0,'-----2-','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('75e26522-167e-4b03-a627-144195e337ed',355,'2011-10-17 11:12:14','混凝土强度等级','2011-10-17 11:32:08',0,'C25',0,'C25----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('7a49cc20-b818-4de3-9dd1-a06eebc73eb4',320,'2011-10-17 11:15:35','砂浆>强度等级','2011-10-17 11:32:08',0,'M7.5',0,'M75----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('7bfefb68-0041-4fcb-bbb2-9960dbf61084',30,'2011-10-17 11:23:47','外加剂','2011-10-17 11:32:08',1,'微膨胀',0,'----W--','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('8082372b-f86c-4bc1-b0cb-49a5ea054d2f',515,'2011-10-17 11:13:39','混凝土强度等级','2011-10-17 11:32:08',0,'C50',0,'C50----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('84355ae8-c84c-4a3b-ae4f-c0a524a731c0',310,'2011-10-17 11:15:17','砂浆强度等级','2011-10-17 11:32:08',0,'M5.0',0,'M50----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('850e1729-4eab-4b3f-81c3-abd1a37ac7d4',475,'2011-10-17 11:13:16','混凝土强度等级','2011-10-17 11:32:08',0,'C45',0,'C45----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('90eda1aa-3a38-4920-aadf-dc5013139f09',30,'2011-10-17 11:19:33','外加剂','2011-10-17 11:32:08',1,'抗渗S8',0,'----8--','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('96a772b7-644b-4636-b2fe-8c1341a94f83',625,'2011-10-17 11:14:19','混凝土强度等级','2011-10-17 11:32:08',0,'C60',0,'C60----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('9f5d6bbe-06e3-4bcc-aca7-2adf4a5fec01',335,'2011-06-22 01:41:07','混凝土强度等级','2011-10-17 11:32:08',0,'C15',0,'C15----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','1','2'),
('a1d4cd20-224b-45ef-a6aa-f26643b68fa4',300,'2011-10-17 11:15:02','强度等级',NULL,0,'M2.5',0,'M25----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2',NULL),
('ab5b63d2-ee71-4574-bf36-69b010135c04',30,'2011-06-22 01:43:42','外加剂','2011-10-17 11:32:08',1,'防冻-5度',0,'-----1-','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','1','2'),
('b14f23e6-6f4f-41b6-90e0-9cd52e8bc1a7',330,'2011-10-17 11:15:50','砂浆强度等级','2011-10-17 11:32:08',0,'M10',0,'M10----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('b55d4ef0-5280-4ff4-96c4-4263ea3ef636',325,'2011-06-22 01:40:08','混凝土强度等级','2011-10-17 11:32:08',0,'C10',0,'C10----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','1','2'),
('ba53a9eb-eba1-4885-90e0-881c298b2d36',20,'2011-10-17 11:25:50','外加剂','2011-10-17 11:32:08',1,'细石',0,'------X','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('bd169a7d-3c04-4511-be12-970909eb7565',80,'2011-10-17 11:25:01','外加剂','2011-10-17 11:32:08',1,'防冻-20度',0,'-----4-','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('c56283e6-ea3c-4058-9fc5-ca7bf0329855',400,'2011-10-17 11:16:24','砂浆强度等级','2011-10-17 11:32:08',0,'M20',0,'M20----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('cb9672eb-a428-46fa-9d54-883fb0b8e1e1',20,'2011-10-17 11:17:11','外加剂','2011-10-17 11:32:08',1,'早强',0,'---Z---','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('db7f309c-64de-436f-b9f5-c325b0be79e1',435,'2011-10-17 11:12:57','混凝土强度等级','2011-10-17 11:32:08',0,'C40',0,'C40----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('dbbe2536-1e84-4b4c-bbc5-7495af32a948',50,'2011-10-17 11:17:26','外加剂','2011-10-17 11:32:08',1,'超早强',0,'---C---','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('e4a3cb79-7b41-4e97-a211-44fc3234dfa8',20,'2011-10-17 11:25:18','外加剂','2011-10-17 11:32:08',1,'超流态',0,'------C','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2'),
('f09aa38f-9eb2-4a8e-86ea-ecbc8c7f76a0',345,'2011-06-22 01:41:30','混凝土强度等级','2011-10-17 11:32:08',0,'C20',0,'C20----','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','1','2'),
('f2604691-0d18-4b57-8280-79384776c909',50,'2011-10-17 11:28:02','冬季施工费','2011-10-17 11:32:08',1,'冬季施工费-10度以上',0,'------2','1','87abb1f6-aa72-4f62-a220-00f2e4306cbf','2','2');

